#+BEGIN_COMMENT
.. title: Org-Babel Cheat Sheet
.. slug: org-babel-cheat-sheet
.. date: 2016-12-29 12:30:23 UTC-08:00
.. tags: org-babel,cheat sheet
.. category: Cheat Sheet
.. link: 
.. description: Collection of org-babel things that I use.
.. type: text
#+END_COMMENT

* Running Tests
   Say there was another section in the document that tangled a test-file (named ~testliterate.py~) to test our main source file. Once both are tangled you can run it in the document using ~sh~ as the language. The org-mode documentation shows a more complex version of this which builds a pass-fail table, but that's beyond me right now.

   #+begin_src org
     ,#+name: shell-run-pytest
     ,#+begin_src sh :results output :exports both
     py.test -v literate_python/testliterate.py
     ,#+end_src
   #+end_src

#+RESULTS: shell-run-pytest
#+begin_example
============================= test session starts ==============================
platform linux -- Python 3.5.1+, pytest-3.0.5, py-1.4.32, pluggy-0.4.0 -- /home/cronos/.virtualenvs/nikola/bin/python3
cachedir: .cache
rootdir: /home/cronos/projects/nikola/posts, inifile: 
plugins: faker-2.0.0, bdd-2.18.1
collecting ... collected 1 items

literate_python/testliterate.py::test_constructor PASSED

=========================== 1 passed in 0.06 seconds ===========================
#+end_example

